case_14/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    waterInlet
    {
        type            calculated;
        value           $internalField;
    }
    airInlet
    {
        type            calculated;
        value           $internalField;
    }
    outlet
    {
        type            calculated;
        value           $internalField;
    }
    freestream
    {
        type            calculated;
        value           $internalField;
    }
    walls
    {
        type            nutkWallFunction;
        value           $internalField;
    }
	axis
	{
		type			empty;
	}
    front
    {
		type			wedge;
	}
	back
	{
		type			wedge;
	}
}

// ************************************************************************* //
